Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFG100.PIC
      <edc:SFRDef edc:_addr="0x1F8012B0" edc:_begin="0x90" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="4" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO2TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO2TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012C0" edc:_begin="0x90" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="5" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO3CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO3CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK3" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012D0" edc:_begin="0x90" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="5" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO3TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO3TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012E0" edc:_begin="0x90" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="6" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO4CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO4CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK4" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012F0" edc:_begin="0x90" edc:_end="0xb0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="6" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO4TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO4TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801300" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="7" edc:access="--------------------r----nnnnnnn" edc:cname="PB1DIV" edc:desc="" edc:impl="0x87f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------1----xxxxxxx" edc:name="PB1DIV" edc:nzwidth="32" edc:por="--------------------1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801310" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="8" edc:access="----------------n---r----nnnnnnn" edc:cname="PB2DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB2DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801320" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="9" edc:access="----------------n---r----nnnnnnn" edc:cname="PB3DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB3DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801330" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="10" edc:access="----------------n---r----nnnnnnn" edc:cname="PB4DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB4DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
