Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFG100.PIC
      <edc:SFRDef edc:_addr="0x1F810040" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIF" edc:desc="" edc:mask="0x1" edc:name="IC5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IF" edc:desc="" edc:mask="0x1" edc:name="IC5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IF" edc:desc="" edc:mask="0x1" edc:name="OC5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IF" edc:desc="" edc:mask="0x1" edc:name="T6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6EIF" edc:desc="" edc:mask="0x1" edc:name="IC6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6IF" edc:desc="" edc:mask="0x1" edc:name="IC6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6IF" edc:desc="" edc:mask="0x1" edc:name="OC6IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810050" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7IF" edc:desc="" edc:mask="0x1" edc:name="T7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7EIF" edc:desc="" edc:mask="0x1" edc:name="IC7EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7IF" edc:desc="" edc:mask="0x1" edc:name="IC7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7IF" edc:desc="" edc:mask="0x1" edc:name="OC7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8IF" edc:desc="" edc:mask="0x1" edc:name="T8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8EIF" edc:desc="" edc:mask="0x1" edc:name="IC8EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8IF" edc:desc="" edc:mask="0x1" edc:name="IC8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8IF" edc:desc="" edc:mask="0x1" edc:name="OC8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9IF" edc:desc="" edc:mask="0x1" edc:name="T9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9EIF" edc:desc="" edc:mask="0x1" edc:name="IC9EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9IF" edc:desc="" edc:mask="0x1" edc:name="IC9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9IF" edc:desc="" edc:mask="0x1" edc:name="OC9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCIF" edc:desc="" edc:mask="0x1" edc:name="ADCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFIFOIF" edc:mask="0x1" edc:name="ADCFIFOIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC3IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC4IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC5IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC6IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF1IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF3IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF4IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF5IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF6IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIF" edc:mask="0x1" edc:name="ADCFLTIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD0IF" edc:desc="" edc:mask="0x1" edc:name="ADCD0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD1IF" edc:desc="" edc:mask="0x1" edc:name="ADCD1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD2IF" edc:desc="" edc:mask="0x1" edc:name="ADCD2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD3IF" edc:desc="" edc:mask="0x1" edc:name="ADCD3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD4IF" edc:desc="" edc:mask="0x1" edc:name="ADCD4IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810060" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS2" edc:desc="" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000000000000000000000000" edc:name="IFS2" edc:nzwidth="32" edc:por="--000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IF" edc:desc="" edc:mask="0x1" edc:name="ADCD5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IF" edc:desc="" edc:mask="0x1" edc:name="ADCD6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IF" edc:desc="" edc:mask="0x1" edc:name="ADCD7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IF" edc:desc="" edc:mask="0x1" edc:name="ADCD8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IF" edc:desc="" edc:mask="0x1" edc:name="ADCD9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IF" edc:desc="" edc:mask="0x1" edc:name="ADCD10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IF" edc:desc="" edc:mask="0x1" edc:name="ADCD11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IF" edc:desc="" edc:mask="0x1" edc:name="ADCD12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IF" edc:desc="" edc:mask="0x1" edc:name="ADCD13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IF" edc:desc="" edc:mask="0x1" edc:name="ADCD14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IF" edc:desc="" edc:mask="0x1" edc:name="ADCD15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IF" edc:desc="" edc:mask="0x1" edc:name="ADCD16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IF" edc:desc="" edc:mask="0x1" edc:name="ADCD17IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IF" edc:desc="" edc:mask="0x1" edc:name="ADCD18IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IF" edc:desc="" edc:mask="0x1" edc:name="ADCD19IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IF" edc:desc="" edc:mask="0x1" edc:name="ADCD20IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IF" edc:desc="" edc:mask="0x1" edc:name="ADCD21IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD22IF" edc:desc="" edc:mask="0x1" edc:name="ADCD22IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IF" edc:desc="" edc:mask="0x1" edc:name="ADCD23IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD24IF" edc:desc="" edc:mask="0x1" edc:name="ADCD24IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD25IF" edc:desc="" edc:mask="0x1" edc:name="ADCD25IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD26IF" edc:desc="" edc:mask="0x1" edc:name="ADCD26IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD27IF" edc:desc="" edc:mask="0x1" edc:name="ADCD27IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD28IF" edc:desc="" edc:mask="0x1" edc:name="ADCD28IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD29IF" edc:desc="" edc:mask="0x1" edc:name="ADCD29IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD30IF" edc:desc="" edc:mask="0x1" edc:name="ADCD30IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD31IF" edc:desc="" edc:mask="0x1" edc:name="ADCD31IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD32IF" edc:desc="" edc:mask="0x1" edc:name="ADCD32IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD33IF" edc:desc="" edc:mask="0x1" edc:name="ADCD33IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD34IF" edc:desc="" edc:mask="0x1" edc:name="ADCD34IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x3fffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810070" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnnnnnnnnnnnnn--nnnnn------" edc:cname="IFS3" edc:desc="" edc:impl="0x1fffe7c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000000000000--00000------" edc:name="IFS3" edc:nzwidth="32" edc:por="---0000000000000000--00000------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCD43IF" edc:desc="" edc:mask="0x1" edc:name="ADCD43IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD44IF" edc:desc="" edc:mask="0x1" edc:name="ADCD44IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPCIF" edc:desc="" edc:mask="0x1" edc:name="CPCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDCIF" edc:desc="" edc:mask="0x1" edc:name="CFDCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBIF" edc:desc="" edc:mask="0x1" edc:name="SBIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIF" edc:desc="" edc:mask="0x1" edc:name="CNEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIF" edc:desc="" edc:mask="0x1" edc:name="CNFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIF" edc:desc="" edc:mask="0x1" edc:name="CNGIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1ffff7c0" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
