Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFG100.PIC
      <edc:SFRDef edc:_addr="0x1F8100E0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000000000000000000000000" edc:name="IEC2" edc:nzwidth="32" edc:por="--000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IE" edc:desc="" edc:mask="0x1" edc:name="ADCD5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IE" edc:desc="" edc:mask="0x1" edc:name="ADCD6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IE" edc:desc="" edc:mask="0x1" edc:name="ADCD7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IE" edc:desc="" edc:mask="0x1" edc:name="ADCD8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IE" edc:desc="" edc:mask="0x1" edc:name="ADCD9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IE" edc:desc="" edc:mask="0x1" edc:name="ADCD10IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IE" edc:desc="" edc:mask="0x1" edc:name="ADCD11IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IE" edc:desc="" edc:mask="0x1" edc:name="ADCD12IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IE" edc:desc="" edc:mask="0x1" edc:name="ADCD13IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IE" edc:desc="" edc:mask="0x1" edc:name="ADCD14IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IE" edc:desc="" edc:mask="0x1" edc:name="ADCD15IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IE" edc:desc="" edc:mask="0x1" edc:name="ADCD16IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IE" edc:desc="" edc:mask="0x1" edc:name="ADCD17IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IE" edc:desc="" edc:mask="0x1" edc:name="ADCD18IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IE" edc:desc="" edc:mask="0x1" edc:name="ADCD19IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IE" edc:desc="" edc:mask="0x1" edc:name="ADCD20IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IE" edc:desc="" edc:mask="0x1" edc:name="ADCD21IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD22IE" edc:desc="" edc:mask="0x1" edc:name="ADCD22IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IE" edc:desc="" edc:mask="0x1" edc:name="ADCD23IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD24IE" edc:desc="" edc:mask="0x1" edc:name="ADCD24IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD25IE" edc:desc="" edc:mask="0x1" edc:name="ADCD25IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD26IE" edc:desc="" edc:mask="0x1" edc:name="ADCD26IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD27IE" edc:desc="" edc:mask="0x1" edc:name="ADCD27IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD28IE" edc:desc="" edc:mask="0x1" edc:name="ADCD28IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD29IE" edc:desc="" edc:mask="0x1" edc:name="ADCD29IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD30IE" edc:desc="" edc:mask="0x1" edc:name="ADCD30IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD31IE" edc:desc="" edc:mask="0x1" edc:name="ADCD31IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD32IE" edc:desc="" edc:mask="0x1" edc:name="ADCD32IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD33IE" edc:desc="" edc:mask="0x1" edc:name="ADCD33IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD34IE" edc:desc="" edc:mask="0x1" edc:name="ADCD34IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x3fffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100F0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="---nnnnnnnnnnnnnnnn--nnnnn------" edc:cname="IEC3" edc:desc="" edc:impl="0x1fffe7c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000000000000--00000------" edc:name="IEC3" edc:nzwidth="32" edc:por="---0000000000000000--00000------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCD43IE" edc:desc="" edc:mask="0x1" edc:name="ADCD43IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD44IE" edc:desc="" edc:mask="0x1" edc:name="ADCD44IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPCIE" edc:desc="" edc:mask="0x1" edc:name="CPCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDCIE" edc:desc="" edc:mask="0x1" edc:name="CFDCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBIE" edc:desc="" edc:mask="0x1" edc:name="SBIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIE" edc:desc="" edc:mask="0x1" edc:name="SPI1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIE" edc:desc="" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIE" edc:desc="" edc:mask="0x1" edc:name="I2C1BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIE" edc:desc="" edc:mask="0x1" edc:name="I2C1SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIE" edc:desc="" edc:mask="0x1" edc:name="I2C1MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIE" edc:desc="" edc:mask="0x1" edc:name="CNAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIE" edc:desc="" edc:mask="0x1" edc:name="CNBIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIE" edc:desc="" edc:mask="0x1" edc:name="CNCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIE" edc:desc="" edc:mask="0x1" edc:name="CNDIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIE" edc:desc="" edc:mask="0x1" edc:name="CNEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIE" edc:desc="" edc:mask="0x1" edc:name="CNFIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIE" edc:desc="" edc:mask="0x1" edc:name="CNGIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1ffff7c0" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810100" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="nnnnnnn--nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC4" edc:desc="" edc:impl="0xfe7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000--00000000000000000000000" edc:name="IEC4" edc:nzwidth="32" edc:por="0000000--00000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMPIE" edc:desc="" edc:mask="0x1" edc:name="PMPIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPEIE" edc:desc="" edc:mask="0x1" edc:name="PMPEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP1IE" edc:desc="" edc:mask="0x1" edc:name="CMP1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IE" edc:desc="" edc:mask="0x1" edc:name="CMP2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBIE" edc:desc="" edc:mask="0x1" edc:name="USBIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBDMAIE" edc:desc="" edc:mask="0x1" edc:name="USBDMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IE" edc:desc="" edc:mask="0x1" edc:name="DMA0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IE" edc:desc="" edc:mask="0x1" edc:name="DMA1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IE" edc:desc="" edc:mask="0x1" edc:name="DMA2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IE" edc:desc="" edc:mask="0x1" edc:name="DMA3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IE" edc:desc="" edc:mask="0x1" edc:name="DMA4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IE" edc:desc="" edc:mask="0x1" edc:name="DMA5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IE" edc:desc="" edc:mask="0x1" edc:name="DMA6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IE" edc:desc="" edc:mask="0x1" edc:name="DMA7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIE" edc:desc="" edc:mask="0x1" edc:name="SPI2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIE" edc:desc="" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIE" edc:desc="" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIE" edc:desc="" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIE" edc:desc="" edc:mask="0x1" edc:name="I2C2BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIE" edc:desc="" edc:mask="0x1" edc:name="I2C2SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIE" edc:desc="" edc:mask="0x1" edc:name="I2C2MIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ETHIE" edc:desc="" edc:mask="0x1" edc:name="ETHIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIE" edc:desc="" edc:mask="0x1" edc:name="SPI3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI3RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI3TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIE" edc:desc="" edc:mask="0x1" edc:name="U3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3RXIE" edc:desc="" edc:mask="0x1" edc:name="U3RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3TXIE" edc:desc="" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xfe7fffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810110" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000000000000000000000000000" edc:name="IEC5" edc:nzwidth="32" edc:por="-0000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3BIE" edc:desc="" edc:mask="0x1" edc:name="I2C3BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIE" edc:desc="" edc:mask="0x1" edc:name="I2C3SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIE" edc:desc="" edc:mask="0x1" edc:name="I2C3MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIE" edc:desc="" edc:mask="0x1" edc:name="SPI4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI4RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI4TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCCIE" edc:desc="" edc:mask="0x1" edc:name="RTCCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIE" edc:desc="" edc:mask="0x1" edc:name="FCEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PREIE" edc:desc="" edc:mask="0x1" edc:name="PREIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SQI1IE" edc:desc="" edc:mask="0x1" edc:name="SQI1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4EIE" edc:desc="" edc:mask="0x1" edc:name="U4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4RXIE" edc:desc="" edc:mask="0x1" edc:name="U4RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4TXIE" edc:desc="" edc:mask="0x1" edc:name="U4TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4BIE" edc:desc="" edc:mask="0x1" edc:name="I2C4BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIE" edc:desc="" edc:mask="0x1" edc:name="I2C4SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIE" edc:desc="" edc:mask="0x1" edc:name="I2C4MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5EIE" edc:desc="" edc:mask="0x1" edc:name="SPI5EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI5RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI5TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5EIE" edc:desc="" edc:mask="0x1" edc:name="U5EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5RXIE" edc:desc="" edc:mask="0x1" edc:name="U5RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5TXIE" edc:desc="" edc:mask="0x1" edc:name="U5TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5BIE" edc:desc="" edc:mask="0x1" edc:name="I2C5BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5SIE" edc:desc="" edc:mask="0x1" edc:name="I2C5SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5MIE" edc:desc="" edc:mask="0x1" edc:name="I2C5MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6IE" edc:desc="" edc:mask="0x1" edc:name="SPI6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI6RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI6TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6EIE" edc:desc="" edc:mask="0x1" edc:name="U6EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIE" edc:desc="" edc:mask="0x1" edc:name="U6RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIE" edc:desc="" edc:mask="0x1" edc:name="U6TXIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
