Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFG100.PIC
      <edc:SFRDef edc:_addr="0x1F8603A0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="CNNED" edc:desc="" edc:impl="0xfe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000---000000" edc:name="CNNED" edc:nzwidth="32" edc:por="----------------0000000---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNED0" edc:mask="0x1" edc:name="CNNED0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED1" edc:mask="0x1" edc:name="CNNED1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED2" edc:mask="0x1" edc:name="CNNED2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED3" edc:mask="0x1" edc:name="CNNED3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED4" edc:mask="0x1" edc:name="CNNED4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED5" edc:mask="0x1" edc:name="CNNED5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNED9" edc:mask="0x1" edc:name="CNNED9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED10" edc:mask="0x1" edc:name="CNNED10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED11" edc:mask="0x1" edc:name="CNNED11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED12" edc:mask="0x1" edc:name="CNNED12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED13" edc:mask="0x1" edc:name="CNNED13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED14" edc:mask="0x1" edc:name="CNNED14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED15" edc:mask="0x1" edc:name="CNNED15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603B0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="CNFD" edc:desc="" edc:impl="0xfe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000---000000" edc:name="CNFD" edc:nzwidth="32" edc:por="----------------0000000---000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFD0" edc:mask="0x1" edc:name="CNFD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD1" edc:mask="0x1" edc:name="CNFD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD2" edc:mask="0x1" edc:name="CNFD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD3" edc:mask="0x1" edc:name="CNFD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD4" edc:mask="0x1" edc:name="CNFD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD5" edc:mask="0x1" edc:name="CNFD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFD9" edc:mask="0x1" edc:name="CNFD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD10" edc:mask="0x1" edc:name="CNFD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD11" edc:mask="0x1" edc:name="CNFD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD12" edc:mask="0x1" edc:name="CNFD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD13" edc:mask="0x1" edc:name="CNFD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD14" edc:mask="0x1" edc:name="CNFD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD15" edc:mask="0x1" edc:name="CNFD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8603C0" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F860400" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnn----" edc:cname="ANSELE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03f0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------111111----" edc:name="ANSELE" edc:nzwidth="0x20" edc:por="----------------------111111----" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE4" edc:desc="" edc:mask="0x1" edc:name="ANSE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE5" edc:desc="" edc:mask="0x1" edc:name="ANSE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE6" edc:desc="" edc:mask="0x1" edc:name="ANSE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE7" edc:desc="" edc:mask="0x1" edc:name="ANSE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE8" edc:desc="" edc:mask="0x1" edc:name="ANSE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE9" edc:desc="" edc:mask="0x1" edc:name="ANSE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
